# MYSQL

q1) Query all columns for all American cities in the CITY table with populations larger than 100000.

In [6]:
#select * from city where countrycode='USA' and population>100000;

q2) Query the NAME field for all American cities in the CITY table with populations larger than 120000.

In [7]:
#select name from city where countrycode='USA' and population>120000;

q3)Query all columns (attributes) for every row in the CITY table.

In [8]:
#select * from city;

q4) Query all columns for a city in CITY with the ID 1661.

In [11]:
#select * from city where id=1661;

q5) Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

In [13]:
#select * from city where countrycose='JPN';

q6) Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

In [14]:
#select name from city where countrycode='JPN';

q7) Query a list of CITY and STATE from the STATION table.

In [15]:
#select city,state from station;

q8)Query a list of CITY names from STATION for cities that have an even ID number. Print the results
in any order, but exclude duplicates from the answer.

In [17]:
#select DISTINCT City from  station where MOD(ID,2)=0 ;

q9)Find the difference between the total number of CITY entries in the table and the number of
distinct CITY entries in the table.

In [19]:
#select count(city) -count(distict city) from station;

q10) Query the two cities in STATION with the shortest and longest CITY names, as well as their
respective lengths (i.e.: number of characters in the name). If there is more than one smallest or
largest city, choose the one that comes first when ordered alphabetically.

In [20]:
#select CITY,LENGTH(CITY) from STATION order by Length(CITY) asc,city asc limit 1; 
#select CITY,LENGTH(CITY) from STATION order by Length(CITY) desc,city asc limit 1;

q11)Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result
cannot contain duplicates.

In [ ]:
#SELECT DISTINCT(CITY) FROM STATION WHERE CITY LIKE 'A%' OR CITY LIKE 'E%' OR CITY LIKE 'I%' OR CITY LIKE 'O%' 
#OR CITY LIKE 'U%' ORDER BY CITY ASC;

q12)Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot
contain duplicates.

In [21]:
#SELECT DISTINCT(CITY) FROM STATION WHERE CITY LIKE '%A' OR CITY LIKE '%E' OR CITY LIKE '%I' OR CITY LIKE '%O' 
#OR CITY LIKE '%U' ORDER BY CITY ASC;

q13)Query the list of CITY names from STATION that do not start with vowels. Your result cannot
contain duplicates.

In [22]:
#select distinct city from station 
#where city Not like 'A%' and city Not like 'E%' and city Not like 'I%' and
#city Not like 'o%' and city not like 'U%';

q14)Query the list of CITY names from STATION that do not end with vowels. Your result cannot
contain duplicates.

In [23]:
#select distinct city from station 
#where city Not like '%A' and city Not like '%E' and city Not like '%I' and
#city Not like '%O' and city not like '%U';

q16)Query the list of CITY names from STATION that either do not start with vowels or do not end
with vowels. Your result cannot contain duplicates.

In [25]:
#SELECT DISTINCT CITY FROM STATION WHERE upper(SUBSTR(CITY,1,1)) NOT IN ('A','E','I','O','U') or lower(SUBSTR(CITY,1,1)) NOT IN
#('a','e','i','o','u');

q16)Query the list of CITY names from STATION that do not start with vowels and do not end with
vowels. Your result cannot contain duplicates.

In [26]:
#SELECT DISTINCT CITY FROM STATION WHERE upper(SUBSTR(CITY,1,1)) NOT IN ('A','E','I','O','U') and lower(SUBSTR(CITY,1,1)) NOT IN
#('a','e','i','o','u');

In [27]:
#q17)Write an SQL query that reports the products that were only sold in the first quarter of 2019. That is,
#between 2019-01-01 and 2019-03-31 inclusive.

SELECT product_id, 

       product_name 
       
FROM   product 

WHERE  product_id  IN 

(SELECT product_id 
                          FROM   sales 
                          WHERE  sale_date  BETWEEN 
                                 '2019-01-01' AND '2019-03-31');

In [28]:
#q18)Write an SQL query to find all the authors that viewed at least one of their own articles.
#Return the result table sorted by id in ascending order.

select author_id as id

from Views

where author_id = viewer_id

group by author_id

order by author_id asc

In [29]:
#q19)Write an SQL query to find the percentage of immediate orders in the table, rounded to 2 decimal places.

select ifnull(
    
    round(
        
        (select count(*) from Delivery where order_date = customer_pref_delivery_date)
        
        /
        
        (count(delivery_id)) * 100
        
        , 2)
    
    , 0
    
) as immediate_percentage from Delivery;

In [30]:
#q20)Write an SQL query to find the ctr of each Ad. Round ctr to two decimal points.
#Return the result table ordered by ctr in descending order and by ad_id in ascending order in case of a tie.

SELECT

    ad_id,
    
    ROUND(IFNULL(SUM(CASE WHEN action='Clicked' THEN 1 ELSE 0 END) * 100 /
                 
    (SUM(CASE WHEN action='Clicked' THEN 1 ELSE 0 END) + SUM(CASE WHEN action='Viewed' THEN 1 ELSE 0 END)), 0), 2)
    
    as ctr
    
FROM Ads

GROUP BY 1

ORDER BY 2 DESC, 1

In [31]:
#q21)Write an SQL query to find the team size of each of the employees.

SELECT employee_id, COUNT(team_id) OVER (PARTITION BY team_id) team_size FROM Employee;

In [32]:
#q22)Write an SQL query to find the type of weather in each country for November 2019. The type of weather is:
#● Cold if the average weather_state is less than or equal 15,
#● Hot if the average weather_state is greater than or equal to 25, and
#● Warm otherwise.

SELECT c.country_name,

CASE (
    
    WHEN AVG(w.weather_state) <= 15 THEN 'Cold'
    
    WHEN AVG(w.weather_state) >= 25 THEN 'Hot' 
    
    'Warm' END ) AS weather_type FROM Weather w INNER JOIN  Countries c ON 

w.country_id = c.country_id

WHERE

LEFT(w.day, 7) = '2019-11'

GROUP BY c.country_name;

In [33]:
#q23)Write an SQL query to find the average selling price for each product. average_price should be rounded to 2 decimal places.

SELECT a.product_id

, round(SUM(a.units * b.price) / SUM(a.units), 2) AS average_price

FROM UnitsSold a

JOIN Prices b

ON (a.product_id = b.product_id
    
AND a.purchase_date >= b.start_date
    
AND a.purchase_date <= b.end_date)

group by product_id

In [34]:
#q24)Write an SQL query to report the first login date for each player.

select player_id, min(event_date) as first_login

from Activity 

group by player_id;

In [35]:
#q25)Write an SQL query to report the device that is first logged in for each player.

SELECT player_id, device_id FROM ( SELECT player_id, device_id,
                                  
event_date,MIN(event_date) OVER(PARTITION BY player_id ORDER BY event_date) as first_login FROM Activity ) t1

 WHERE event_date = first_login;

In [36]:
#q26)Write an SQL query to get the names of products that have at least 100 units ordered in February 2020 and their amount.

select a.product_name, sum(unit) as unit from Products a left join Orders b on a.product_id = b.product_id

where b.order_date between '2020-02-01' and '2020-02-29'

group by a.product_id

having sum(unit) >= 100;

In [37]:
#q27)Write an SQL query to find the users who have valid emails.
#A valid e-mail has a prefix name and a domain where:
#● The prefix name is a string that may contain letters (upper or lower case), digits, underscore
#'_', period '.', and/or dash '-'. The prefix name must start with a letter.
#● The domain is '@leetcode.com'.

SELECT * FROM Users

WHERE REGEXP_LIKE(mail, '^[a-zA-Z][a-zA-Z0-9\_\.\-]*@leetcode.com')

In [38]:
#q28)Write an SQL query to report the customer_id and customer_name of customers who have spent at
#least $100 in each month of June and July 2020.

WITH result as (

SELECT 
    o.customer_id,
    
    c.name,
    
    DATE_FORMAT(o.order_date, '%Y-%m') as order_date, 
    
    SUM(quantity * price) as total_spend
    
FROM Orders as o JOIN Product as p

ON o.product_id = p.product_id

JOIN Customers as c

ON o.customer_id = c.customer_id

GROUP BY 1, 2, 3

ORDER BY 1

)

SELECT DISTINCT customer_id,name FROM result 

WHERE customer_id IN (SELECT customer_id FROM result 

WHERE order_date = '2020-06' 

                      AND total_spend >= 100)
                      
AND customer_id IN (SELECT customer_id FROM result 

   WHERE order_date = '2020-07' 
                    AND total_spend >= 100)

In [39]:
#29)Write an SQL query to report the distinct titles of the kid-friendly movies streamed in June 2020.

select distinct c.title

from content c  join prog p

on c.content_id = p.content_id and

c.kids_content='Y' and date(p.prog_date)>= '2020-06-01'and date(p.prog_date)<= '2020-06-30'
;

In [40]:
#30)Write an SQL query to find the npv of each query of the Queries table.

select q.id, q.year, ifnull(n.npv,0) as npv from queries as q left join npv as n

on (q.id, q.year) = (n.id, n.year);

In [41]:
#32)Write an SQL query to show the unique ID of each user, If a user does not have a unique ID replace just show null.

select unique_id, name from Employees left join EmployeeUNI

on if (Employees.id = EmployeeUNI.id, Employees.id, null);

In [1]:
#q33) Write an SQL query to report the distance travelled by each user.
#Return the result table ordered by travelled_distance in descending order, if two or more users
#travelled the same distance, order them by their name in ascending order.

select name, sum(ifnull(distance, 0)) as travelled_distance from rides r right join users u on r.user_id = u.id group by name

order by 2 desc,1 asc;

In [2]:
#q34)Write an SQL query to get the names of products that have at least 100 units ordered in February 2020
#and their amount.

select a.product_name, sum(unit) as unit from Products a left join Orders b on a.product_id = b.product_id

where b.order_date between '2020-02-01' and '2020-02-29' group by a.product_id having sum(unit) >= 100

In [4]:
#q35)Find the name of the user who has rated the greatest number of movies. In case of a tie,
#return the lexicographically smaller user name.
#● Find the movie name with the highest average rating in February 2020. In case of a tie, return
#the lexicographically smaller movie name.

SELECT user_name AS results FROM

(
SELECT a.name AS user_name, COUNT(*) AS counts FROM Movie_Rating AS b
    
    JOIN Users AS a
    
    on a.user_id = b.user_id
    
    GROUP BY b.user_id
    
    ORDER BY counts DESC, user_name ASC LIMIT 1
    
) first_query

UNION

SELECT movie_name AS results FROM

(
SELECT c.title AS movie_name, AVG(d.rating) AS rate FROM Movie_Rating AS d
    
    JOIN Movies AS c
    
    on c.movie_id = d.movie_id
    
    WHERE substr(d.created_at, 1, 7) = '2020-02'
    
    GROUP BY d.movie_id
    
    ORDER BY rate DESC, movie_name ASC LIMIT 1
    
) second_query;

In [5]:
#q36)Write an SQL query to report the distance travelled by each user.
#Return the result table ordered by travelled_distance in descending order, if two or more users
#travelled the same distance, order them by their name in ascending order.

select name, sum(ifnull(distance, 0)) as travelled_distance from rides r right join users u on r.user_id = u.id

group by name order by 2 desc,1 asc;

In [6]:
#q37)Write an SQL query to show the unique ID of each user, If a user does not have a unique ID replace just show null.

SELECT unique_id, name FROM Employees LEFT JOIN EmployeeUNI using(id)

In [7]:
#q38)Write an SQL query to find the id and the name of all students who are enrolled in departments that no longer exist.

select id, name from Students where department_id not in (select id from Departments);

In [8]:
#39)Write an SQL query to report the number of calls and the total call duration between each pair of
#distinct persons (person1, person2) where person1 < person2.

select from_id as person1,to_id as person2,

    count(duration) as call_count, sum(duration) as total_duration
    
from (select * 
      
      from Calls 
      
      union all
      
      select to_id, from_id, duration 
      
      from Calls) t1

where from_id < to_id

group by person1, person2

In [9]:
#40)Write an SQL query to find the average selling price for each product. average_price should be rounded to 2 decimal places.

select UnitsSold.product_id, round(sum(units*price)/sum(units), 2) as average_price

from UnitsSold inner join Prices

on UnitsSold.product_id = Prices.product_id

and UnitsSold.purchase_date between Prices.start_date and Prices.end_date

group by UnitsSold.product_id

In [10]:
#41)Write an SQL query to report the number of cubic feet of volume the inventory occupies in each warehouse.

select name as warehouse_name, sum(units * vol) as volume

from Warehouse w

join (select product_id, Width*Length*Height as vol
      
     from Products) p

on w.product_id = p.product_id

group by name

In [11]:
#42)Write an SQL query to report the difference between the number of apples and oranges sold each day.

select a.sale_date, a.sold_num - b.sold_num from Sales a left join Sales b on a.sale_date = b.sale_date

where a.fruit = 'apples' and b.fruit = 'oranges';

In [12]:
#43)Write an SQL query to report the fraction of players that logged in again on the day after the day they

#first logged in, rounded to 2 decimal places. In other words, you need to count the number of players

#that logged in for at least two consecutive days starting from their first login date, then divide that

#number by the total number of players.

WITH CTE AS ( SELECT player_id, min(event_date) as event_start_date from Activity group by player_id )

SELECT

round((count(distinct c.player_id) / (select count(distinct player_id) from activity)),2)as fraction

FROM CTE c

JOIN Activity a

on c.player_id = a.player_id

and datediff(c.event_start_date, a.event_date) = -1

In [13]:
#44)Write an SQL query to report the managers with at least five direct reports.

SELECT e1.Name

FROM Employee e1

JOIN (
    
SELECT ManagerId 
    
FROM Employee
    
GROUP BY ManagerId
    
HAVING COUNT(ManagerId) >= 5
    
) e2

ON e1.Id = e2.ManagerId;

In [ ]:
#45)Write an SQL query to report the respective department name and number of students majoring in
#each department for all departments in the Department table (even ones with no current students).
#Return the result table ordered by student_number in descending order. In case of a tie, order them by
#dept_name alphabetically.

select  a.dept_name, coalesce(count(student_id), 0) student_number from  department a  left join student b

on 

    a.dept_id = b.dept_id
    
group by a.dept_name

order by student_number desc, a.dept_name asc;

In [14]:
#46)Write an SQL query to report the customer ids from the Customer table that bought all the products in the Product table.

select customer_id from Customer group by customer_id having count(distinct product_key) = 

    (select count(distinct product_key) from Product)

In [15]:
#47)Write an SQL query that reports the most experienced employees in each project. In case of a tie,

#report all employees with the maximum number of experience years.

select project_id, employee_id from Project join Employee using (employee_id) where (project_id, experience_years) in (
    
    select project_id, max(experience_years)
    
    from Project
    
    join Employee
    
    using (employee_id)
    
    group by project_id)

In [16]:
#48)Write an SQL query that reports the books that have sold less than 10 copies in the last year,
#excluding books that have been available for less than one month from today. Assume today is 2019-06-23.

select book_id, name 

from books

where book_id not in (

    select book_id 
    
    from orders 
    
    where (dispatch_date between date_sub('2019-06-23',interval 1 year) and '2019-06-23')
    
    group by (book_id)
    
    having sum(quantity) >= 10)
    
and 

    available_from < date_sub('2019-06-23', interval 1 month)

In [17]:
#49)Write a SQL query to find the highest grade with its corresponding course for each student. In case of
#a tie, you should find the course with the smallest course_id.

select e1.student_id, min(e1.course_id) as course_id, e1.grade

from Enrollments e1

where e1.grade = 

    (select max(grade) as max_grade
     
    from Enrollments e2
     
    where e1.student_id = e2.student_id)
    
group by e1.student_id

order by e1.student_id

In [19]:
#50)The winner in each group is the player who scored the maximum total points within the group. In the
#case of a tie, the lowest player_id wins.
#Write an SQL query to find the winner in each group.

select group_id,player_id from 

(select group_id,player_id,sum((
    
    case when player_id = first_player then first_score
    
         when player_id = second_player then second_score
    
         end
    
)) as totalScores
 
from Players p,Matches m
 
where p.player_id = m.first_player
 
or p.player_id = m.second_player
 
group by group_id,player_id
 
order by group_id,totalScores desc,player_id) as temp

group by group_id

order by group_id,totalScores desc,player_id